{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "same", "subsample": [1, 1], "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "nb_filter": 1, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 1, "batch_input_shape": [null, 90, 320, 3], "bias": true, "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "nb_row": 1}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_2", "b_constraint": null, "activity_regularizer": null, "nb_filter": 24, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 5, "bias": true, "init": "glorot_uniform", "activation": "tanh", "nb_row": 5}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_3", "b_constraint": null, "activity_regularizer": null, "nb_filter": 36, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 5, "bias": true, "init": "glorot_uniform", "activation": "tanh", "nb_row": 5}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_4", "b_constraint": null, "activity_regularizer": null, "nb_filter": 48, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 3, "bias": true, "init": "glorot_uniform", "activation": "tanh", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_5", "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 3, "bias": true, "init": "glorot_uniform", "activation": "tanh", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1164, "input_dim": null, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activation": "tanh"}}, {"class_name": "Dense", "config": {"output_dim": 100, "input_dim": null, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activation": "tanh"}}, {"class_name": "Dense", "config": {"output_dim": 50, "input_dim": null, "name": "dense_3", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activation": "tanh"}}, {"class_name": "Dense", "config": {"output_dim": 10, "input_dim": null, "name": "dense_4", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activation": "tanh"}}, {"class_name": "Dense", "config": {"output_dim": 1, "input_dim": null, "name": "dense_5", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activation": "tanh"}}]}