{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_regularizer": null, "nb_row": 1, "batch_input_shape": [null, 90, 320, 3], "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_1", "nb_filter": 1, "border_mode": "same", "bias": true, "activation": "linear", "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "dim_ordering": "tf", "trainable": true, "input_dtype": "float32", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_2", "nb_filter": 24, "border_mode": "valid", "bias": true, "activation": "tanh", "subsample": [1, 1], "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"p": 0.75, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_3", "nb_filter": 36, "border_mode": "valid", "bias": true, "activation": "tanh", "subsample": [1, 1], "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"p": 0.75, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_4", "nb_filter": 48, "border_mode": "valid", "bias": true, "activation": "tanh", "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "border_mode": "valid", "pool_size": [2, 4], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_3"}}, {"class_name": "Dropout", "config": {"p": 0.75, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "border_mode": "valid", "bias": true, "activation": "tanh", "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_4"}}, {"class_name": "Dropout", "config": {"p": 0.75, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 1164, "bias": true, "activation": "tanh", "W_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 100, "bias": true, "activation": "tanh", "W_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 50, "bias": true, "activation": "tanh", "W_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 10, "bias": true, "activation": "tanh", "W_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 1, "bias": true, "activation": "tanh", "W_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_5"}}]}