{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "init": "glorot_uniform", "batch_input_shape": [null, 90, 320, 3], "border_mode": "same", "b_constraint": null, "activation": "linear", "nb_col": 1, "W_regularizer": null, "trainable": true, "nb_filter": 1, "nb_row": 1, "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_31", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "activation": "tanh", "nb_col": 10, "W_regularizer": null, "nb_filter": 14, "name": "convolution2d_32", "nb_row": 10, "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_21", "strides": [4, 4], "pool_size": [4, 4], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.75, "trainable": true, "name": "dropout_21"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "activation": "tanh", "nb_col": 7, "W_regularizer": null, "nb_filter": 28, "name": "convolution2d_33", "nb_row": 7, "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_22", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.75, "trainable": true, "name": "dropout_22"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_11"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_regularizer": null, "trainable": true, "output_dim": 128, "b_constraint": null, "activity_regularizer": null, "activation": "tanh", "W_constraint": null, "name": "dense_31", "input_dim": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_regularizer": null, "trainable": true, "output_dim": 8, "b_constraint": null, "activity_regularizer": null, "activation": "tanh", "W_constraint": null, "name": "dense_32", "input_dim": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "activation": "tanh", "W_constraint": null, "name": "dense_33", "input_dim": null}}]}