{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 90, 320, 1], "input_dtype": "float32", "nb_col": 1, "activation": "linear", "name": "convolution2d_1", "b_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "same", "b_constraint": null, "nb_filter": 1, "nb_row": 1, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 8, "activation": "relu", "name": "convolution2d_2", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 24, "nb_row": 8, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 5, "activation": "relu", "name": "convolution2d_3", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 36, "nb_row": 5, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "activation": "relu", "name": "convolution2d_4", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 48, "nb_row": 3, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "activation": "relu", "name": "convolution2d_5", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 64, "nb_row": 3, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "relu", "name": "dense_1", "b_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "output_dim": 1024, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "relu", "name": "dense_2", "b_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "output_dim": 512, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "relu", "name": "dense_3", "b_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "output_dim": 256, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "relu", "name": "dense_4", "b_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "output_dim": 128, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "tanh", "name": "dense_5", "b_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "output_dim": 64, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "tanh", "name": "dense_6", "b_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "output_dim": 32, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "linear", "name": "dense_7", "b_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "output_dim": 1, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}]}