{"config": [{"config": {"activation": "linear", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "subsample": [1, 1], "b_regularizer": null, "nb_col": 1, "bias": true, "dim_ordering": "tf", "nb_row": 1, "b_constraint": null, "W_constraint": null, "input_dtype": "float32", "activity_regularizer": null, "nb_filter": 1, "name": "convolution2d_4", "batch_input_shape": [null, 90, 320, 3]}, "class_name": "Convolution2D"}, {"config": {"activation": "tanh", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "b_regularizer": null, "nb_col": 10, "bias": true, "dim_ordering": "tf", "nb_row": 10, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "nb_filter": 14, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [4, 4], "strides": [4, 4], "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.75, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "b_regularizer": null, "nb_col": 7, "bias": true, "dim_ordering": "tf", "nb_row": 7, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "nb_filter": 28, "name": "convolution2d_6"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.75, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"output_dim": 128, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "tanh", "W_constraint": null, "activity_regularizer": null, "name": "dense_4", "input_dim": null}, "class_name": "Dense"}, {"config": {"output_dim": 8, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "tanh", "W_constraint": null, "activity_regularizer": null, "name": "dense_5", "input_dim": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "tanh", "W_constraint": null, "activity_regularizer": null, "name": "dense_6", "input_dim": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}