{"config": [{"config": {"init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "nb_row": 1, "W_constraint": null, "name": "convolution2d_22", "b_constraint": null, "dim_ordering": "tf", "nb_filter": 1, "batch_input_shape": [null, 90, 320, 3], "nb_col": 1, "bias": true, "input_dtype": "float32", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_row": 10, "W_constraint": null, "name": "convolution2d_23", "b_constraint": null, "dim_ordering": "tf", "nb_filter": 14, "nb_col": 10, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [4, 4], "name": "maxpooling2d_12", "trainable": true, "dim_ordering": "tf", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_11", "trainable": true, "p": 0.75}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_row": 7, "W_constraint": null, "name": "convolution2d_24", "b_constraint": null, "dim_ordering": "tf", "nb_filter": 28, "nb_col": 7, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_13", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_12", "trainable": true, "p": 0.75}, "class_name": "Dropout"}, {"config": {"name": "flatten_5", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "name": "dense_10", "b_constraint": null, "input_dim": null, "bias": true, "output_dim": 128, "W_regularizer": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "name": "dense_11", "b_constraint": null, "input_dim": null, "bias": true, "output_dim": 8, "W_regularizer": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "name": "dense_12", "b_constraint": null, "input_dim": null, "bias": true, "output_dim": 1, "W_regularizer": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}