{"keras_version": "1.1.1", "config": [{"config": {"nb_filter": 1, "nb_col": 1, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "batch_input_shape": [null, 90, 320, 1], "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 1, "b_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "nb_col": 8, "b_regularizer": null, "border_mode": "valid", "nb_filter": 24, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 8, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "nb_filter": 36, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 5, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_4", "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_filter": 48, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 3, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_3", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_5", "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 3, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_4", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1024, "name": "dense_1", "b_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"output_dim": 512, "name": "dense_2", "b_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"output_dim": 256, "name": "dense_3", "b_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"output_dim": 128, "name": "dense_4", "b_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"output_dim": 64, "name": "dense_5", "b_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"output_dim": 32, "name": "dense_6", "b_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"output_dim": 1, "name": "dense_7", "b_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}