{"config": [{"config": {"name": "convolution2d_1", "border_mode": "same", "activity_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "nb_filter": 1, "batch_input_shape": [null, 90, 320, 3], "b_constraint": null, "nb_row": 1, "bias": true, "init": "glorot_uniform", "input_dtype": "float32", "subsample": [1, 1], "nb_col": 1, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "nb_filter": 14, "b_constraint": null, "nb_row": 10, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 10, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [4, 4], "dim_ordering": "tf", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.75}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "nb_filter": 28, "b_constraint": null, "nb_row": 7, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 7, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.75}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "output_dim": 128, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activity_regularizer": null, "output_dim": 8, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activity_regularizer": null, "output_dim": 1, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}